### Terraform Plan for Stage 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront must be replaced
+/- resource "aws_acm_certificate" "cloudfront" {
      ~ arn                       = "arn:aws:acm:us-east-1:339713113237:certificate/39ddd986-d123-4f96-9a10-1b65ce2d4938" -> (known after apply)
      ~ domain_name               = "designmanual.stage.vylabs.io" -> "stage.design.vy.no" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "designmanual.stage.vylabs.io"
              - resource_record_name  = "_2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_db86bc4f553f2925c8ec2b319cae1b4f.xlfgrmvvlj.acm-validations.aws."
            },
          - {
              - domain_name           = "stage.design.vy.no"
              - resource_record_name  = "_01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6f54842553ae95e2784bc31973c7a290.xlfgrmvvlj.acm-validations.aws."
            },
          + {
              + domain_name           = "stage.design.vy.no"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:339713113237:certificate/39ddd986-d123-4f96-9a10-1b65ce2d4938" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2026-11-19T23:59:59Z" -> (known after apply)
      ~ not_before                = "2025-10-21T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "designmanual.stage.vylabs.io",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ options (known after apply)
      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate.cloudfront (deposed object d4ae9329) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_acm_certificate" "cloudfront" {
      - arn                       = "arn:aws:acm:us-east-1:339713113237:certificate/7d6f4b2d-20e4-45a6-997f-7a400985330f" -> null
      - domain_name               = "designmanual.stage.vylabs.io" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "designmanual.stage.vylabs.io"
              - resource_record_name  = "_2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_db86bc4f553f2925c8ec2b319cae1b4f.xlfgrmvvlj.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:339713113237:certificate/7d6f4b2d-20e4-45a6-997f-7a400985330f" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2026-11-19T23:59:59Z" -> null
      - not_before                = "2025-10-21T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - region                    = "us-east-1" -> null
      - renewal_eligibility       = "INELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "designmanual.stage.vylabs.io",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
          - export                                      = "DISABLED" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_acm_certificate_validation.cloudfront will be created
  + resource "aws_acm_certificate_validation" "cloudfront" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + region                  = "us-east-1"
      + validation_record_fqdns = (known after apply)

      + timeouts {
          + create = "45m"
        }
    }

  # module.app.module.cloudfront_ssr.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                         = [
          - "designmanual.stage.vylabs.io",
            # (1 unchanged element hidden)
        ]
        id                              = "E1QEGTKX2K9D0J"
        tags                            = {}
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:339713113237:certificate/39ddd986-d123-4f96-9a10-1b65ce2d4938" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["designmanual.stage.vylabs.io"] will be destroyed
  # (because key ["designmanual.stage.vylabs.io"] is not in for_each map)
  - resource "aws_route53_record" "cert_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io.stage.design.vy.no" -> null
      - id                               = "Z0722810AV0KRO9KN5XS__2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_2608a9a4d0acdfa8e9d431642f3a9da4.designmanual.stage.vylabs.io" -> null
      - records                          = [
          - "_db86bc4f553f2925c8ec2b319cae1b4f.xlfgrmvvlj.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z0722810AV0KRO9KN5XS" -> null
        # (2 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cert_validation["stage.design.vy.no"] must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      ~ fqdn                             = "_01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no" -> (known after apply)
      ~ id                               = "Z0722810AV0KRO9KN5XS__01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_01389e0da5b0547e4398c3ed80adf3d6.stage.design.vy.no" -> (known after apply) # forces replacement
      ~ records                          = [
          - "_6f54842553ae95e2784bc31973c7a290.xlfgrmvvlj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.app.module.cloudfront_ssr.aws_route53_record.cloudfront_alias["designmanual.stage.vylabs.io"] will be destroyed
  # (because key ["designmanual.stage.vylabs.io"] is not in for_each map)
  - resource "aws_route53_record" "cloudfront_alias" {
      - fqdn                             = "designmanual.stage.vylabs.io.stage.design.vy.no" -> null
      - id                               = "Z0722810AV0KRO9KN5XS_designmanual.stage.vylabs.io_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "designmanual.stage.vylabs.io" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0722810AV0KRO9KN5XS" -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "dmlx0eoq2xrsw.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.app.module.cloudfront_ssr.aws_ssm_parameter.for_pipeline will be updated in-place
  ~ resource "aws_ssm_parameter" "for_pipeline" {
        id              = "/__deployment__/applications/digitalekanaler-designmanual/cloudfront_domain_name"
      + insecure_value  = (known after apply)
        name            = "/__deployment__/applications/digitalekanaler-designmanual/cloudfront_domain_name"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.replacement["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "replacement" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:339713113237:listener-rule/app/common-services-alb-alb/68013d1e868afe73/40b90bdc4b91ae7c/a5163c3d0fa3e924"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "designmanual.stage.vylabs.io",
                  - "stage.design.vy.no",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "stage.design.vy.no",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

  # module.app.module.ssr_task.aws_lb_listener_rule.service["0"] will be updated in-place
  ~ resource "aws_lb_listener_rule" "service" {
        id           = "arn:aws:elasticloadbalancing:eu-west-1:339713113237:listener-rule/app/common-services-alb-alb/68013d1e868afe73/9ba7a735a3186a57/5f573fafcb48022c"
        tags         = {}
        # (5 unchanged attributes hidden)

      - condition {
          - host_header {
              - values = [
                  - "designmanual.stage.vylabs.io",
                  - "stage.design.vy.no",
                ] -> null
            }
        }
      + condition {
          + host_header {
              + values = [
                  + "stage.design.vy.no",
                ]
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 4 to change, 5 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 4955c86c20e05f7527da5a38d7b6c34fb31736aa*
*Plan generated at: 2025-10-22 08:55:38 UTC*
